In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("raw_data.csv")

In [5]:
df.duplicated() #Checks for dulicates row wise

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [7]:
df[["country", "gender"]].duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

In [ ]:
df.drop_duplicates()    #won't modify the original data

    id         name   age country   gender
0    1      JohnDoe  29.0     USA     Male
2    2    JaneSmith   NaN  Canada   Female
3    3         Alex   NaN     USA  Unknown
4    4  MariaGarcia  34.0   Spain   Female
5    5        LiWei  27.0   China     Male
6    6          NaN  45.0   India   Female
7    7    AhmedKhan  38.0     NaN     Male
8    8    RachelLee  29.0     USA   Female
9    9   CarolsRuiz   NaN  Mexico     Male
10  10   EmilyDavis  31.0     USA   Female

In [9]:
df.drop_duplicates(inplace=True)

In [10]:
df

    id         name   age country   gender
0    1      JohnDoe  29.0     USA     Male
2    2    JaneSmith   NaN  Canada   Female
3    3         Alex   NaN     USA  Unknown
4    4  MariaGarcia  34.0   Spain   Female
5    5        LiWei  27.0   China     Male
6    6          NaN  45.0   India   Female
7    7    AhmedKhan  38.0     NaN     Male
8    8    RachelLee  29.0     USA   Female
9    9   CarolsRuiz   NaN  Mexico     Male
10  10   EmilyDavis  31.0     USA   Female